# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "mas"
brew "svn"  # Needed for source-code-pro (not *-nerd-font)

# Applications
cask "adobe-digital-editions"
cask "alfred"
cask "bettertouchtool"
cask "calibre"
cask "clion"
cask "discord"
cask "firefox"
cask "hazel"
cask "istat-menus"
cask "kitty"
cask "obsidian"
cask "openvpn"
cask "spotify"
cask "transmission"
cask "wireshark"

# Fonts
cask "font-3270-nerd-font"
cask "font-cascadia-mono"
cask "font-cinzel"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"

# macOS App Store
mas "1Password", id: 1333542190
mas "Fantastical", id: 975937182
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Super Agent", id: 1568262835
mas "Timery", id: 1425368544
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "ack"
brew "bat"
brew "cloc"
brew "exa"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnupg"
brew "grep"
brew "htop"
brew "lazygit"
brew "markdown"
brew "neovim"
brew "python"
brew "rocket"
brew "shellcheck"
brew "tmux"
brew "z"
brew "zsh"
