# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "mas"
brew "svn"  # Needed for source-code-pro (not *-nerd-font)

# Applications
cask "kitty"
cask "hazel"
cask "istat-menus"
cask "obsidian"
cask "alfred"
cask "bettertouchtool"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-3270-nerd-font"
cask "font-source-code-pro"
cask "font-sauce-code-pro-nerd-font"

# macOS App Store
mas "Fantastical", id: 975937182
mas "Xcode", id: 497799835
mas "Deliveries", id: 290986013
mas "1Password", id: 1333542190
mas "Timery", id: 1425368544

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "ack"
brew "bat"
brew "cloc"
brew "git-delta"
brew "exa"
brew "fzf"
brew "git"
brew "gnupg"
brew "grep"
brew "htop"
brew "lazygit"
brew "markdown"
brew "neovim"
brew "python"
brew "shellcheck"
brew "tmux"
brew "z"
brew "zsh"
